<template>
    <div>
        <div style="height:60px; background:#000"></div>
        <div class="banner_customer">
            <h2>智能预测性维护</h2>
        </div>
        <div class="customer_text" >
            <div>
                <h3>应用场景</h3>
                <p>随着物联网技术的创新和发展，工程制造设备变得更加高效与智能，但设备本身维护工作却仍面临巨大挑战。维护不善会使工厂的生产率降低5-20%，而计划之外的生产中断会使一些大型制造商每年损失500亿美元。传统维护模式中的故障后维护与定期维护将影响生产效率与产品质量，并大幅提高制造商的成本。随着物联网、大数据、云计算、机器学习与传感器等技术的成熟，预测性维护技术应运而生。</p>
                <p>所谓预测性维护，就是借助算法分析检测故障发生前的机械状态，并预测故障发生的时间。除此之外，还能够确定可延长机械使用寿命的主动性任务类型。要预测出一套设备出故障的可能性，除了从设备数据中整理出关键的指标，还要结合更多的历史经验进行分析，最终形成一个与设备对应预测性维护模型。预测性维护的复杂性在于这套基于机器学习的生产系统模型必需随着时间而改变。</p>
            </div>
        </div>
        <div class="customer_text" >
            <div>
                <h3>产品方案</h3>
                <img style="margin-bottom:20px;" src="../../static/dev_slices/light.jpg" alt=""  width="100%" height="100%">
                <p>本系统通过监测普通手电筒用白炽灯泡的外部参数，温度，亮度，预测灯泡会不会在15分钟内发生故障。系统采用了监督学习的解决方案。通过对收集后的传感器数据加标签，将灯泡的状态区分为：0-15分钟内可能发生故障，15分钟至3小时之间可能发生故障和3小时内不会发生故障。我们将采集传感器的数据进行整理加工后，用其中70%的数据训练机器学习算法，再使用剩余30%的数据进行验证，从而得出了较为理想的模型。将模型应用到系统中后，可以对当前使用中的灯泡进行寿命预测。整套方案用极低的成本模拟了工业互联网领域的预测性维护技术。</p>
            </div>
        </div>
         <div class="customer_text" >
            <div>
                <h3>产品特点</h3>
                <p>整个系统结构简单，安装，维护方便。由于采用了LeapAI.com云平台，省去了在本地部署，维护服务器硬件及操作系统软件的繁琐工作。云平台运行的应用可靠性高，可以在任何地点安全访问。LeapAI.com高效的应用框架也使得应用的开发，升级及维护变得异常轻松。</p>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    name:'case4',
    mounted(){
        window.scrollTo(0,0);
    }
}
</script>
