<template>
    <div>
        <div style="height:60px; background:#000"></div>
        <div class="rule">
            <ul class="list">
                <li @click="showSectionOne" :class="{'section_part':sectionText}">注册协议</li>
                <li @click="showSectionTwo" :class="{'section_part':!sectionText}">开发者合作协议</li>
            </ul>
            <div class="section" v-show="sectionText">
                <h2> LeapAI.com平台注册协议</h2>
                <p>欢迎访问联想LeapAI.com平台（以下简称“本平台”）。本平台由天津联想软件有限公司（以下简称“联想”）基于互联网为您提供。如果您要申请成为本平台的开发者（会员），您应当认真阅读并完全同意：</p>
                <p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本平台的法律公告</p>
                <p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本平台的<a href="https://www.lenovo.com.cn/public/privacy.html" target="_blank" style="color:#333;font-weight:400;">隐私条款</a></p>
                <p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本协议项下的全部条款并按照页面上的提示完成全部的注册程序；和您已经年满十八（18）岁，并且有能够独立承担民事责任能力；如果您不满十八（18）岁，须由您的父母或法定监护人为您完成注册。
                    如果您不接受本注册协议，请不要继续使用本平台。
                    完成注册后，您将获得一个用户名和密码，但这并不意味着您已经成为本平台的开发者。您还须依照联想的要求履行其他义务及相应程序方可成为本平台的开发者。
                    您点击“我同意”或“我接受”按钮的行为将表明您完全理解并接受本协议。
                </p>
                <h4>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;定义</h4>
                <ul>
                    <li>
                        <span>1.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>用户名：指您通过注册用以登录本平台会员服务的符号，亦称为“帐号”。</span>
                    </li>
                    <li>
                        <span> 1.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> 
                        <span>网络服务：指联想依照相关法律法规的规定及本协议第3条的约定通过互联网向您提供的服务。</span>
                    </li>
                </ul>
                <h4>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户名的注册与保管</h4>     
                <ul>
                    <li>
                        <span>2.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您申请注册成为本平台会员时，必须向联想提供真实且准确的个人资料或企业信息，并于个人资料或企业信息发生任何变动时及时更新。您在注册过程中输入的姓名、企业名称和证件号码将作为识别您与用户名的一致性的首要证明资料。在您无法有效证明身份时，联想有权拒绝向您提供任何服务或承担任何义务。</span>
                    </li>
                    <li>
                        <span>2.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>
                            您注册的用户名应当遵守以下规则：<br>
                            2.1&nbsp;&nbsp;不得以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；<br>
                            2.2&nbsp;&nbsp;不得以国家机构或其他机构的名称或其简称或商标、商号注册； <br>
                            2.3&nbsp;&nbsp;不得注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的名字； <br>
                            2.2&nbsp;&nbsp;不得注册易产生歧义、引起他人误解的名字。 <br>
                            如果您注册的用户名违反了任何上述规则，或联想收到任何第三方对您注册的用户名发出的权利声明或异议，联想有权在不事先通知您的情况下拒绝您的注册或者删除您已经注册的用户名。
                        </span>
                    </li>
                    <li>
                        <span>2.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您注册时登记的用户名和密码是您会员身份的唯一有效识别信息。您有义务对您的用户名和密码进行妥善保管。您不得将您的用户名、密码给予他人使用，其形式包括但不限于出借、转让、许可使用。您理解，在任何情况下，联想并无核查每一用户名使用合法性的义务，因此，如果您发现您的用户名受到他人非法使用时，应当立即通知联想。由于您疏于保管或黑客行为等原因造成的用户名、密码丢失，或用户名、密码被盗用及由此产生的相应损失，联想均不承担责任。</span>
                    </li>
                    <li>
                        <span>2.4. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如您不愿再使用本平台，可以申请注销您的注册。注销后，您不再享有使用本平台的任何权利。如联想发现您有违反本协议条款的情况，有权不予通知您而立即注销您的注册；如果您注册的用户名在任何连续180自然日内未实际使用，则联想有权在单方通知您后，删除该帐号并终止为您提供相关的网络服务。</span>
                    </li>
                    <li>
                        <span>2.5. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您应当对以您的用户名发生的所有活动和事件承担全部法律责任。联想保留删除任何其认为您在本平台张贴的不符合联想内容标准的资料或信息的权利。</span>
                    </li>
                </ul>  
                <h4>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;网络服务条款</h4>     
                <ul>
                    <li>
                        <span>3.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>服务<br></span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.1. </span>
                        <span>基于本协议，联想将为您提供以下网络服务：<br>
                        （1）浏览本平台为会员提供的信息；<br>
                        （2）下载本平台为会员开放的资源，如API及其他开发文件等；<br>
                        （3）登陆本平台论坛，与其他开发者进行技术交流。<br>
                        （4）上传和管理应用程序。<br>
                         联想有权随时修改、撤销或拒绝对本平台的访问或加以其他限制，并有权根据实际情况决定、变更、改进及调整提供网络服务的内容，联想对其所提供之服务拥有最终解释权。
                        </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.2. </span>
                        <span>您理解，您完成注册并成为本平台会员并不意味着您能够使用联想通过本平台提供的全部网络服务。部分网络服务可能需要您与联想就该部分网络服务签署相关的协议并履行联想要求的义务及相应的程序后方可依照协议约定使用。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.3. </span>
                        <span>您理解，联想仅提供本协议约定的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由您自行负担。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.4. </span>
                        <span>联想可能或今后可能就其提供的部分网络服务收费，您应当为使用该等收费网络服务向联想支付一定的费用。对于收费的网络服务，联想会在您使用之前给予您明确的提示，只有您根据提示确认并支付相关费用后，方有权使用该等收费网络服务。在您全额支付相关费用之前联想有权拒绝向您提供该等收费网络服务。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.5. </span>
                        <span>您无争议地同意：联想有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。在该等情况下，联想将及时通知您。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.6. </span>
                        <span>您理解，联想需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护。如因此类情况而造成网络服务在合理时间内的中断，联想无需为此承担任何责任。联想将在条件允许的情况下，尽可能事先以适当的方式通知您，但前述通知并非联想必须履行的义务。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.7. </span>
                        <span>您有权依照本平台规定的程序和要求使用联想提供的各项服务。如果您对联想提供的某项服务有异议，可以依照本平台提供的联系方式与本平台取得联系以便得到及时解决。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.8. </span>
                        <span>为促进开发者共享及合作，并营造一个安全、高效的信息交流平台，联想将不时制订一些公共规则或要求。联想没有通知贵方该等规则发布或变更的责任和义务，贵方将保证随时了解并遵守之。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.9. </span>
                        <span>为您使用之便利，联想可能提供链接到由第三方拥有或经营的但非本服务范围的互联网站；您一旦进入第三方网站或者使用第三方工具从第三方网站获得资源，需了解并同意其使用规则。联想对该等第三方网站、第三方工具及其它资源所包含的任何服务或信息不承担责任。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.1.10.</span>
                        <span>联想为保证网站运营安全，将在法律允许的范围内，对您上传、张贴的信息、资料进行审核或测试。但无论如何，该等测试或审查并不代表、也不能被视为联想对贵方提供应用产品的合法性、安全性及适用性所作的默许、认可、保证或承诺。</span>
                    </li>
                    <li style="margin-top:10px;">
                        <span>3.2.1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您在使用联想网络服务过程中，必须遵循以下规则：<br>
                        （1） 遵守中国有关的法律、法规和规范性文件；<br>
                        （2） 遵守所有与网络服务有关的网络协议、规定和程序；<br>
                        （3） 不得为任何非法目的而使用网络服务系统；<br>
                        （4） 不得利用联想网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的任何行为，包括但不限于不得传播或张贴垃圾邮件、不合理巨大文件、传销模式、连锁邮件；<br>
                        （5）不得利用联想提供的网络服务，上传、储存、展示或传播任何非法的、虚假的、辱骂性的、骚扰性的、诽谤性的或其他违反社会公德的信息资料；<br>
                        （6）不得从事任何侵犯其他任何第三方的专利权、著作权、商标权、名誉权、隐私权或其他任何合法权益的行为；<br>
                        （7）不得利用联想网络服务系统进行任何不利于联想或危害计算机信息网络安全的行为；<br>
                        （8）未经联想事先的许可，不得利用联想网络服务系统进行商业广告行为；<br>
                        （9）如发现任何非法使用或企图非法使用用户名或用户名出现或可能出现安全漏洞的情况，应立即通知联想。
                        </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.2.2. </span>
                        <span>您无争议的同意，针对联想提供的网络服务，联想有权随时通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）做出任何相关的声明、通知、警示。该等声明、通知、警示的内容视为本协议的一部分，如您在联想做出该等声明、通知、警示后使用该等网络服务，视为您完全同意该等声明、通知、警示的内容。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.2.3. </span>
                        <span>在下列情形下，联想有权随时中断或终止向您提供本协议项下的网络服务（包括收费的网络服务）而无需对您或任何第三方承担任何责任：<br>
                            （1）您提供的个人资料不真实；或<br>
                            （2）您违反本协议中规定的使用规则。在此等情形下，联想亦有权要求您改正或自行更改/删除您发布的全部或部分信息、资料。<br>
                             &nbsp;您理解并同意：在您或联想将资料、数据或信息从本平台中删除后，其痕迹可能残留并且其复本仍可能存在于服务器之内，但联想不对此承担任何责任。
                        </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.2.4. </span>
                        <span>联想不就下述事项向您做任何形式的担保或保证：<br>
                        （1）网络服务一定能满足您的要求；<br>
                        （2）网络服务的持续畅通，不中断；<br>
                        （3）网络服务的及时性、安全性、准确性；<br>
                        （4）您在本平台浏览或下载的任何文件、链接的兼容性、安全性、可用性及不侵权。
                        </span>
                    </li>
                </ul>
                <h4>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;知识产权</h4>     
                <ul>
                     <li>
                        <span>4.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想提供的网络服务中可能包括文本、图片、图形、图表、软件、音频和/或视频资料等均受著作权、商标和/或其它财产所有权法律的保护。</span>
                    </li> 
                    <li>
                        <span>4.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您只有获得相关权利人同意之后，才能依照相关权利人授权的范围使用上述资料。否则，您不得复制、发布、传播、修改、再创造上述资料，亦不得将上述资料用于其他任何商业目的。</span>
                    </li>
                    <li>
                        <span>4.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您在使用本平台期间持续地保证：<br>
                            4.3.1.任何由您上传到本平台的资料、数据或信息将被视为非机密的。<br>
                            4.3.2.您通过本平台发布的内容的合法性及安全性；对您发布内容的浏览、下载、使用等任何行为均不存在由于您的原因而遭受损害的可能性，包括但不限于侵权异议、感染病毒、遭到黑客攻击、系统瘫痪等；<br>
                            4.3.3您对通过本平台发布、传播的内容享有知识产权或已就相关行为获得相关权利人的授权，并对上述保证事项承担全部法律责任；<br>
                            4.3.4若因您违反上述保证而引起任何第三方对联想的索赔、交涉、诉讼，您应为联想抗辩，或在联想的要求下合作抗辩，保证联想利益不受损害，您应就因此而产生的所有损失承担全部责任。
                        </span>
                    </li>
                </ul>
                <h4>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;违约赔偿</h4>     
                <ul>
                    <ul>
                        <li><span>您有义务保障和维护联想及其他用户的利益。如因您违反有关法律、法规、规范性文件的规定或本协议项下的任何条款而给联想或任何其他第三人造成损失，您同意承担由此造成的全部损害赔偿责任。</span></li>
                    </ul>
                </ul>
                <h4>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;责任限制</h4>     
                <ul>
                    <li>
                        <span>6.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在任何情况下，无论您以何种依据（包括根本违约、过失、虚假陈述或其他合约或侵权方面的索赔）而有权要求联想赔偿损失，联想的责任仅限于实际直接损害或损失，且赔偿额最高为联想基于服务向您实际收取的费用总额。此限制也适用于任何联想分包商和供应商。这是联想及其分包商和供应商共同承担的最高赔偿限额。</span>
                    </li>
                    <li>
                        <span>6.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在任何情况下，即使联想获通知有发生下列事项的可能性，联想均不对下列任何一项负责：<br>
                        6.2.1第三方就其损失或损害赔偿向您提起的索赔要求；<br>
                        6.2.2您的记录或数据的丢失或损毁；<br>
                        6.2.3任何间接性的，偶然性的或附带性的损害或利润损失。<br>
                        </span>
                    </li>
                    <li>
                        <span>6.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您所在的国家或地区的法律可能不允许以合同方式对某些责任进行排除或限制，则在法律禁止的最大范围内，上述某些责任限制或排除条款不适用于您。</span>
                    </li>
                </ul>
                <h4>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;不可抗力</h4>     
                <ul>
                    <li>
                        <span>7.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>“不可抗力”是指本协议双方不能预见、不能避免并且不能克服的客观情况，其情形包括：火灾、地震、洪水、战争、罢工、网络堵塞或瘫痪、病毒、黑客攻击等。</span>
                    </li>
                    <li>
                        <span>7.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>遭受不可抗力事件的一方可暂行中止履行本协议项下的义务直至不可抗力事件的影响消除为止，并且无需为此而承担违约责任；但应尽最大努力克服该等事件，减轻其负面的影响。</span>
                    </li>
                </ul>
                <h4>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一般条款</h4>     
                <ul>
                    <li>
                        <span>8.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>协议修改 </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.1.1. </span>
                        <span>您同意，联想有权随时修改本协议的任何条款。您应经常访问本页面以了解当前的条款。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.1.2. </span>
                        <span>如您不同意联想对本协议相关条款所做的修改，应当立即停止使用您的帐号。如果您在联想对本协议相关条款做出修改后继续使用您的帐号登陆本平台，则视为您完全接受联想对本协议相关条款所做的全部修改。</span>
                    </li>
                    <li>
                        <span>8.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>通讯</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.2.1. </span>
                        <span>您同意，本协议的签署及联想根据本协议向您提供的通知、披露等均可以电子方式进行。本协议项下联想通过网页公告、电子邮件、手机短信或常规的信件传送等方式向您发出的通知自联想发送之日视为已送达。</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.2.2. </span>
                        <span>您对于联想的通知应当通过联想对外正式公布的通信地址、传真号码、电子邮件地址等联系信息向联想进行书面送达。</span>
                    </li>
                    <li>
                        <span>8.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>其他规定</span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.3.1. </span>
                        <span>本协议中的标题仅为方便而设，在解释本协议时应被忽略。 </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.3.2. </span>
                        <span>本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。 </span>
                    </li>
                    <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.3.3. </span>
                        <span>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款及该条款的其他部分仍应有效并且有约束力。 </span>
                    </li>
                     <li>
                        <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.3.4. </span>
                        <span>本协议按照中华人民共和国大陆地区（不包括香港和澳门特别行政区）的可适用法律订立和解释。因本协议执行、解释以及与此有关的一切争议和纠纷均应提交联想所在地有管辖权的法院裁决。 </span>
                    </li>
                </ul>
            </div>
            <div class="section" v-show="!sectionText" >
                <h2>LeapAI.com平台开发者合作协议</h2>
                <p>本协议由您和天津联想软件有限公司（以下称“联想”）就LeapAI.com平台（以下称“本平台”）开发者合作之事宜签订。您应仔细阅读并充分理解本协议之内容。您点击“我同意”或“我接受”按钮的行为将表明您完全理解并接受本协议。</p>
                <h4>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;定义</h4>
                <ul>
                    <li> 
                        <span>1.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> 
                        <span> “LeapAI.com平台”: 是指由联想运营的供应用产品的开发者依照本协议的约定上传应用产品、管理应用产品的销售及进行技术交流的平台(LeapAI.com)。</span>
                    </li>
                    <li> 
                        <span> 1.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> 
                        <span>“应用产品”：是指您基于本平台开发并依照本协议提交联想审核、测试的程序以及该等程序中所包含的由您自行上传的互联网电子信息。</span>
                    </li>
                    <li>
                        <span> 1.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>  
                        <span>“服务”: 根据上下文，服务是指您就应用产品向联想或联想用户提供的支持服务；或/和通过互联网向用户有偿或无偿提供各种信息的服务。</span>
                    </li>
                    <li>
                        <span>1.4. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> 
                        <span>“用户”：是指任何于联想本平台上开发的应用下载、购买应用产品或互联网信息服务的最终用户。</span> 
                    </li>
                    <li>
                        <span>1.5. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>  
                        <span>“分发”: 是指联想作为您的代理根据本协议的约定通过网络下载、无线传输等方式向用户提供应用产品或电子信息。</span>
                    </li>
                    <li> 
                        <span> 1.6. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span> 
                        <span>“商业标识”：是指本协议一方拥有或基于协议或法律规定控制的任何商标、商号、名称、字号，以及其他用于确定物料归属、类别的特定的图形、文字及其它标志、标识</span>
                    </li>
                    <li>
                        <span> 1.7. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> 
                        <span>“关联机构”：一方的关联机构是指由一方直接或间接控制；或直接或间接控制一方；或与一方受同一家公司直接或间接控制的机构。这里的“机构”指任何人、公司、企业或其他法律实体；“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、协议或其他方式。</span> 
                    </li>
                </ul>
                <h4>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;联想开发平台帐号</h4>
                <ul>
                    <li>
                        <span>2.1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您认可，在签署本协议之前，您已经依照本平台要求的程序进行了注册与激活，并获得一个用户名（亦称“帐号”）和密码。您注册及使用帐号的行为应当遵守《LeapAI.com平台注册协议》的约定。</span>
                    </li>
                    <li>
                        <span>2.2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>经过联想审核，如联想认为您符合开发者的条件，您即成为本平台的开发者；如联想认为您不符合开发者的条件，您将无法成为本平台的开发者。联想不保证您一定能够成为联想应用的开发者</span>
                    </li>
                    <li>
                        <span>2.3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您应对您的用户名和密码进行妥善保管。您不得将您的用户名、密码向他人披露或给予他人使用，其形式包括但不限于出借、转让、许可使用。</span>
                    </li>
                    <li>
                        <span>2.4. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您独自为您的用户名的安全性负责。在任何情况下，联想并无核查每一用户名使用合法性的义务；因此，如果您发现您的用户名受到他人非法使用时，应当立即通知联想。在任何情况下，联想均不就第三方使用您用户名的行为给您造成的损失承担任何责任，包括但不限于由于您疏于保管或黑客行为等原因造成的用户名、密码丢失，或用户名、密码被盗用及由此产生的相应损失。</span>
                    </li>
                    <li>
                        <span>2.5. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>任何以您的用户名发生的行为视为由您作出，由您对其承担全部法律责任。</span>
                    </li>
                    <li>
                        <span>2.6. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您应保证您的帐号在本协议有效期内持续有效。如您的帐号无效、被撤销、被封号将导致本协议的提前终止。</span>
                    </li>
                </ul>
                <h4>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;应用产品的提交、测试与审核</h4>
                <ul>
                    <li>
                        <span>3.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>对于您希望利用本平台资源开发并通过本平台分发的应用产品，您可通过您的帐号依照联想要求的标准或规范在本平台进行在线提交。联想有权根据实际情况，要求您提交（1）应用产品的可执行程序、产品说明书、技术支持文档、演示说明文档等可交付物；（2）或互联网信息的准确、真实来源等。</span>
                    </li>
                    <li>
                        <span>3.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想将在收到您提交的应用产品后自行或委托第三方依照联想的标准对应用产品进行测试与审核。测试与审核可能需要较长的期限；无论如何，该等测试或审查并不代表、也不能被视为联想对您提供应用产品的合法性、安全性及适用性所作的默许、认可、保证或承诺。</span>
                    </li>
                    <li>
                        <span>3.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想有权依照其单方的判断决定应用产品是否通过审核。如联想认为产品符合本平台标准，则将通过电子邮件的方式向您注册时登记的电子邮箱发送《应用产品审核通知》或类似文件，自该等函件发出之日起，您与联想就您当次提交的应用产品开始进行本协议所述合作；如联想认为应用产品不符合本平台标准，也可能通过电子邮件的方式向您注册时登记的电子邮箱发送邮件通知。无论如何，联想未向您发送电子邮件通知的测试结果不能被视为，也不得将其解释为联想已审核通过。联想不保证您提交的应用产品一定能够在本平台发布，并有权以任何理由或无理由拒绝应用产品。</span>
                    </li>
                </ul>
                <h4>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;许可</h4>
                <ul>
                    <li>
                        <span>4.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您授予联想一个非独占的、可分许可和可转让的、不可撤消的、世界范围的和免费的许可，使联想可以自行或许可其关联机构按照本协议的规定使用应用产品。根据该许可：（A）联想可以自行或委托第三方对应用产品进行测试、评测；（B）如应用产品通过测试获取联想认可，则联想可以作为您的代理通过网站下载、无线传输等方式将应用产品分发给用户；（C）将应用产品单独或与其他应用产品一并与联想设备捆绑或组成套装件，分发给用户；和（D）自行或许可第三方演示、评论、讲解应用产品的全部或部分。除非许可期限依照本协议的约定被提前终止，许可期限与本协议有效期一致。除前述授权之外，联想有权仅为存档之目的保留一份应用产品的备份。并且，根据实际需要，联想有可能要求您为配合审核要求而提供应用产品的源代码，您据此授予联想一个为审核目的而使用源代码的充分必要许可。</span>
                    </li>
                    <li>
                        <span>4.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>非经联想，可由您直接授权用户通过本平台下载、安装和使用应用产品。如果应用产品中未附带《最终用户许可协议》，则附件一《最终用户许可协议》将在您与下载您应用产品的用户之间适用。如果您随应用产品附带一个《最终用户许可协议》，那么该《最终用户许可协议》中至少应包含以下内容：（A）“无保证声明”及“责任限制”条款，并且该等条款应实质上与附件一中的“无保证声明”及“责任限制条款”一致；（B）明确声明应用产品的服务均由您提供，并明确联想、联想的关联机构、供应商、联想产品的制造商不承担应用产品的售后服务。您与用户之间就使用应用产品产生的任何争议由您与用户协商解决，联想及其关联机构不就此承担任何责任。</span>
                    </li>
                    <li>
                        <span>4.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在您成为本平台开发者的前提下，针对平台的某些资源以您按约定付费为前提，联想授予您一个非独占的、不可分许可的、不可转让的许可，使您可以使用本平台上联想所提供的API接口等资源进行应用产品的开发，该许可仅限于实现与联想合作之目的。除本条款明确约定外，联想并未就平台上所提供的API接口等资源授予您其他任何权利。除非事先获取联想的书面许可，您不得对平台上所提供的资源从事任何反编译、反向工程等行为。</span>
                    </li>
                </ul>
                <h4>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;应用产品的服务</h4>
                <ul>
                    <li>
                        <span>5.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>自应用产品被联想接受之日起，您应向联想提供应用产品及其相关可交付物的任何更新和升级，包括但不限于对应用产品的错误修正、功能改进，以及为支持变更的环境系统而对应用产品及其相关可交付物进行的修改和变更（“应用产品变更”）。您应在应用产品变更日的合理期限前，以书面形式将足够详细的应用产品更新情况通知联想，联想有权选择使用新版本或继续使用原有版本。</span>
                    </li>
                    <li>
                        <span>5.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您应承担适用法律规定的对用户的服务义务，承担使用户满意的责任。您并须为此遵守本协议及联想不时发布的服务政策中的相关规定，包括参加联想指定的客户满意计划。无论如何，您不得拒绝用户合法、正当的服务请求。</span>
                    </li>
                    <li>
                        <span>5.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>对于用户投诉的应用产品问题，您应当在一周内自担费用予以解决。在处理用户投诉的过程中，您不得以联想名义向用户进行任何解释、承诺或保证，亦不得进行任何有损联想名誉的行为。</span>
                    </li>
                    <li>
                        <span>5.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如您与用户之间另有保修或其他支持服务协议（“保修文件”）的，则应使用该等保修文件。</span>
                    </li>
                    <li>
                        <span>5.5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如您需要指定一名您本人以外的技术支持联系人专为本协议之合作提供支持。请提供其具体信息如下：<br/>技术支持联系人:<br/>联系电话：<br/>传真：<br/>邮件：</span>
                    </li>
                </ul>
                <h4>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;应用产品的上架及下架</h4>
                <ul>
                    <li>
                        <span>6.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想有权依照其单方的判断决定应用产品是否上传至本平台供用户下载（“上架”）。您同意，联想并无上传您的应用产品的义务，即使这些应用产品已经通过了联想的审核。应用产品上架后，联想将以电子邮件的形式通知您。</span>
                    </li>
                    <li>
                        <span>6.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您同意，联想有权随时单方面中止或终止分发应用产品（“下架”）。如联想中止或终止分发应用产品，联想将在应用产品下架后以电子邮件的方式通知您。</span>
                    </li>
                    <li>
                        <span>6.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想有权单方决定对应用产品在本平台里的放置位置。</span>
                    </li>
                </ul>
                <h4>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;知识产权</h4>
                <ul>
                    <li>
                        <span>7.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>知识产权归属：（A）在签署本协议之前属于一方的技术以及一方在本协议之外开发的技术仍归该方所有。（B）除本协议及相关附件另有约定外，一方基于本协议所开发的新技术归开发方所有。</span>
                    </li>
                    <li>
                        <span>7.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>商业标识：如您需使用联想商业标识，应提前书面通知联想并经双方另行签署《商业标识许可协议》后依该协议执行。您许可联想或联想的关联机构为执行本协议的目的且在为实现此目的所必要的范围和限度内使用您的商标、商号或其他体现您表征的商业标识。</span>
                    </li>
                </ul>
                <h4>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;陈述和保证</h4>
                <ul>
                    <li>
                        <span>8.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>就本协议项下提供的应用产品、可交付物和服务（包括互联网信息服务），您提供如下持续的陈述和保证：（A）您有权签署本协议并且您对本协议的履行将符合任何您受约束或将要受约束的合同条款、义务和法律要求；（B）您具有合法的资质从事提供应用产品、可交付物及各项服务；（C）不存在已经或可能发生的针对您且可能会妨碍联想在本协议项下任何权利的索赔、他项权或法律行动；（D）应用产品、可交付物和服务不会侵犯任何第三方的隐私权、形象、声誉或知识产权；并且符合中国及其他可适用国家或地区的相关法律、法规及政策的要求；（E）您已经向联想书面披露任何现有的包含在应用产品、可交付物中的或与其一同提供的第三方代码，包括但不限于开源代码，并且您及应用产品、可交付物均符合适用于该第三方代码的任何许可协议；（F）在法律允许的限度内，所有的作者已经同意将不会主张其在应用产品、可交付物中的精神权利（即根据可适用法律，与作者身份有关的人身权）；（G）应用产品、可交付物和服务将符合本协议项下的各项保证、规格、标准和要求，并且在符合上述保证、规格、标准和要求的情况下使用是安全的；（H）应用产品及可交付物不包含有害代码、病毒；（I）服务将以合理的谨慎和技能提供并且符合本协议的规定；（J）应用产品及可交付物将不使用电子自助程序；（K）应用产品及可交付物包括其文字、符号及标注将符合可适用的政府和权威民间机构的标准和要求；（L）您充分了解并且已经和将会充分遵守所有可适用的进出口法律、法规、命令和政策（包括但不限于中国、美国及相关国际组织的进出口管制法律和条约）；（M）除为履行本协议的目的且仅限于在必要的限度内，您将不会使用、披露或跨境传递任何为联想处理的可用于确定个人身份的信息（“个人数据”）；（N）您将遵守所有可适用的隐私权法律和法规，将采取和维持适当的技术和其他措施保护个人数据，将报告任何对个人数据保护的违反，并将充分配合联想有关使用、修正和销毁您所掌握的个人数据的要求；并且（O）本协议及其附件中关于应用产品及服务的期限或使用范围等条款，并不影响您对用户在服务期限及服务内容等方面应尽的义务或承诺。</span>
                    </li>
                    <li>
                        <span>8.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想就本协议做出下述陈述和保证：（A）联想有权利签署和执行本协议；（B）联想将依照本协议及附件的约定使用应用产品及互联网信息服务。</span>
                    </li>
                    <li>
                        <span>8.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如您的应用产品、可交付物或服务与上述保证不符，您应承担费用及时修改或替换可交付物或重新提供服务。如果您未能这样做，联想可通过书面通知的形式提前解除本协议或/和项下的附件。上述处理并不限制联想采取依法可以采取的其他救济措施的权利。本协议中的上述保证取代所有其他保证和条件，无论是明示的还是默示的，包括那些有关适销性和适用于某特定目的的保证和条件。</span>
                    </li>
                    <li>
                        <span>8.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>为促进开发者共享及合作，并营造一个安全、高效的信息交流平台，联想将不时制订一些公共规则。联想没有通知您该等规则发布或变更的责任和义务，您将保证随时了解并遵守之。</span>
                    </li>
                </ul>
                <h4>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;抗辩和补偿</h4>
                <ul>
                    <li>
                        <span>9.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>对因您或您提供的应用产品、可交付物或服务（包括互联网信息服务）违反本协议的陈述和保证及其他约定而引起的针对联想、联想关联机构、联想合同厂商及联想雇员的任何索赔、交涉、调查、处罚、禁止或诉讼，您应为联想抗辩，或在联想的要求下合作抗辩，保证联想、联想关联机构、联想合同厂商及联想雇员的利益不受损害，您并应承担因此而产生的所有赔偿、罚款、律师费和损害赔偿。在这种索赔、交涉、调查、处罚、禁止或诉讼已经发生或有证据表明可能发生时，您应自行承担费用并按如下程序采取可行的补救措施：（A）使联想得到继续使用应用产品、可交付物的权利；（B）修改受到影响的技术，使其可被不受妨碍地使用并符合本协议；（C）用不存在法律争议且符合本协议的应用产品替换受到影响的应用产品；和/或（D）如联想有要求，联想可向您退回应用产品及可交付物，您应退还已付金额，赔偿联想因此遭受的损失。当联想知道会发生上述条款所列禁止、交涉、诉讼或索赔时，应及时通知您。</span>
                    </li>
                </ul>
                <h4>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;责任限制</h4>
                <ul>
                    <li>
                        <span>10.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在任何情况下，无论您以何种依据（包括根本违约、过失、虚假陈述或其他合约或侵权方面的索赔）而有权要求联想赔偿损失，联想的责任仅限于实际直接损害或损失，且赔偿额最高为联想向您收取的平台维护管理及相关服务费用的总额。此限制也适用于任何联想分包商和供应商。这是联想及其分包商和供应商共同承担的最高赔偿限额。</span>
                    </li>
                    <li>
                        <span>10.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在任何情况下，即使联想获通知有发生下列事项的可能性，联想均不对下列任何一项负责：(1)第三方就其损失或损害赔偿向您提起的索赔要求；(2)您的记录或数据的丢失或损毁；和(3)任何间接性的，偶然性的或附带性的损害或利润损失。</span>
                    </li>
                    <li>
                        <span>10.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您所在的国家或地区的法律可能不允许以合同方式对某些责任进行排除或限制，则在法律禁止的最大范围内，上述某些责任限制或排除条款不适用于您。</span>
                    </li>
                </ul>
                <h4>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;保密</h4>
                <ul>
                    <li>
                        <span>11.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议签署前及在本协议期限内，一方（“披露方”）曾经或可能向对方（“接收方”）披露该方的商业、技术或其他信息、资料，这些信息或资料在披露时被指定为保密（或有类似标注），或在保密情况下披露，或依双方合理商业判断应为保密信息（“保密信息”）。在相关保密信息披露后的三（3）年内，接收方必须：（A）对保密信息进行保密；（B）仅为本协议的目的使用保密信息；并且（C）除为履行职责确有必要知悉保密信息的该方雇员（或其关联机构、律师、会计师或其他顾问）外，不向其他任何人披露保密信息，且上述人员应签署严格程度不得低于本条规定的书面保密协议或承诺。</span>
                    </li>
                    <li>
                        <span>11.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>上款规定的义务对以下信息不适用：（A）在披露时已属于或在披露后进入公共领域的信息，但因接收方违反保密义务所导致的除外；（B）在披露时接收方已经掌握的且对其不承担保密义务的信息；（C）在未违反本协议的情况下接收方从披露方之外的来源获得的信息；（D）由披露方在未附带保密义务的情况下提供给第三方的信息；或（E）接收方未利用披露方披露的信息独立开发的信息。</span>
                    </li>
                    <li>
                        <span>11.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议终止后或经披露方随时要求，接收方应（A）向披露方归还（或经披露方要求销毁）根据本协议提供的包含披露方保密信息的所有材料（包括其复制件）；并（B）在披露方提出此项要求后十（10）日内向披露方书面保证已经归还或销毁上述材料。</span>
                    </li>
                    <li>
                        <span>11.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如接收方违反本协议的不使用和保密义务，披露方可要求按下列方式处理：（A）由接收方承担费用按披露方的指示采取有效的方法对保密信息进行保密；和/或（B）接收方向披露方支付五（5）万元人民币的违约金；如接收方将保密信息提供、泄露给披露方的竞争对手，则违约金支付额应增加至十（10）万元人民币。</span>
                    </li>
                    <li>
                        <span>11.5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如各方就本协议项下服务另外签署了保密协议，则双方交流的信息依该协议保护。在不限制本协议任何规定的条件下，保密义务适用于所有规格、需求和支持文件。本协议及附件的条款和条件应视为保密信息。</span>
                    </li>
                </ul>
                <h4>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;救济</h4>
                <ul>
                    <li>
                        <span>12.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>违反本协议及其任何相关协议的行为均为违约行为。任何一方违约在收到对方发出的违约通知后应采取有效合理的补救措施纠正其违约行为，采取补救措施并不减免违约方应当承担的违约金。</span>
                    </li>
                    <li>
                        <span>12.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议约定的违约金不足以弥补守约方所遭受的损失的，违约方应继续补偿守约方的损失。本协议所称损失应包括因违约行为所导致的守约方的损失，以及守约方为处理违约事件所发生的包括调查、仲裁、诉讼、律师等法律费用在内的费用和开支。</span>
                    </li>
                </ul>
                <h4>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;期限和终止；终止的效果</h4>
                <ul>
                    <li>
                        <span>13.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>
                            本协议自以下情形之一发生之日起生效（以先发生者为准），有效期至本协议依照约定被终止之日：<br>
                            13.1.1&nbsp;&nbsp; 联想依照本协议的约定向您以电子邮件的方式发送《开发者确认函》或类似文件；<br>
                            13.1.2&nbsp;&nbsp; 联想将您提交的应用产品放置于本平台。<br>
                        </span>
                    </li>
                    <li>
                        <span>13.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在下列情况下，一方可经提前三十（30）天向对方发出书面通知终止本协议且不承担任何责任：（A）对方实质性违反本协议且未能在守约方发出书面通知指明该违约事项后三十（30）日内采取有效补救措施纠正的；或（B）除适用的破产法所禁止的情形外，如对方被宣告破产、无力偿付到期债务、或因其他事由丧失履约能力、资产被受让人或其他债权人接收。
                              除上述规定外，您同意，联想有权在任何时候以通知或公告的形式单方终止本协议而无需承担任何责任。</span>
                    </li>
                    <li>
                        <span>13.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议无论因何种原因终止后，联想应停止继续使用应用产品。但任何您授予最终用户的应用产品的使用许可仍然有效，不受本协议规定的许可期限的影响。</span>
                    </li>
                    <li>
                        <span>13.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>对于上款所列产品及协议终止后仍在服务期内的产品，您在协议终止后应继续提供本协议约定的售后服务及技术支持。</span>
                    </li>
                    <li>
                        <span>13.5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议终止后，您不再是本协议项下的开发者。联想将通知您，在一个合理期限后删除您于本网站上发布、储存的任何数据、信息或应用产品；合理期限届满后，联想有权随时删除前述数据、信息或应用产品且不就其为您提供任何备份。</span>
                    </li>
                    <li>
                        <span>13.6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议无论因到期或其他任何原因终止的，本协议项下的 [知识产权]、[陈述和保证]、[抗辩和补偿]、[保密]、[救济]、[期限和终止；终止的效果]和[一般条款]以及本协议其他依其性质应当延续其效力的条款将延续并继续有效直至得到完全履行。</span>
                    </li>
                </ul>
                <h4>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;一般条款</h4>
                <ul style="margin-bottom:50px;">
                    <li>
                        <span>14.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>独立主体。除本协议另有明确约定外，本协议双方并未通过本协议的签署而在相互间建立任何合伙、联营、代理、信托、雇用、劳动或劳务等关系，并且双方也无意建立类似关系。</span>
                    </li>
                    <li>
                        <span>14.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>分包和转让。除本协议另有约定者外，未经它方事先书面允许，任何一方不得将本协议的部分或全部转让、转包或分包给任何第三方。联想可根据其业务模式安排其关联机构执行本协议项下的部分或全部业务。</span>
                    </li>
                    <li>
                        <span>14.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>完整协议。本协议构成您与联想之间就本协议标的达成的全部协议，并替代双方在本协议签署前或执行过程中就本协议标的所做的任何口头或书面的交流、声明、谅解或协议。任何附加的或与此不同的条款和条件均不适用。</span>
                    </li>
                    <li>
                        <span>14.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>修改。联想保留在必要时修改本协议的部分条款的权利，一旦本协议的内容发生变动，联想将会提前合理的时间通过包括但不限于（a）网页公告；（b）电子邮件；和/或（c）短信提醒等方式通知您。请不时阅读本协议的最新版本，以便掌握任何变动情况。如您不同意该项变更，那么您应在变更发生前书面告知联想取消和停止合作或者停止使用您的帐号，否则视为您接受了变更后的协议。</span>
                    </li>
                    <li>
                        <span>14.5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>可分割。如本协议的任何条款被有管辖权的裁判机构裁定在某些方面无效或不可执行，且这种无效或不可执行性不会对双方在本协议中的权利义务造成实质性的影响，则本协议将继续有效。任何被裁定为仅在某些方面或某种程度上无效或不可执行的条款，在未被裁定为无效或不可执行的程度或范围内仍然具有完全的效力。</span>
                    </li>
                    <li>
                        <span>14.6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>非弃权。本协议的有效弃权须经弃权方书面签署；一方对另一方不履行本协议的义务和责任的某些事件放弃追究并不表示对以后发生的事件也放弃追究。</span>
                    </li>
                    <li>
                        <span>14.7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>公平交易。您不得向与您有实际或潜在业务关系的联想或联想关联机构的员工和/或其家属提供任何酬金、礼物或其它有形或无形的利益（在商业交往中按照商业惯例赠送小额广告礼品的除外），任何此类行为均视为商业贿赂，双方同意此类行为将给联想带来实质性损害。此类行为一经发现，联想除可解除本协议或相关附件外，还可要求您支付相关附件金额的百分之十（10%）或五（5）万元作为违约金，以较高者为准。</span>
                    </li>
                    <li>
                        <span>14.8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>公开。如一方拟发布任何与本协议或因本协议引起的任何事件（包括但不限于双方合作关系）有关的新闻稿、公告、声明、广告或进行宣传，均应交对方审核并经对方事先书面同意，但对方不得不合理地拖延或拒绝同意。尽管有上述规定，任何一方均可：（A）在符合保密协议的前提下向其股东、董事、官员、雇员、律师、会计师和其他专业人员，或（B）根据其所在司法管辖区域证券或其他相关法律的要求披露本协议和相关附件。</span>
                    </li>
                    <li>
                        <span>14.9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>信息使用。联想及其关联机构将在其经营业务的任何地方存储、处理和使用您的交易及联系信息。上述信息将为双方的合作关系而处理和使用。联想也可能为业务目的将您提供的个人信息提供给联想的承包商、业务伙伴及指定方，或者根据法律的要求披露您提供的信息。如您向联想提供属于第三方的个人信息，您应保证履行了法律要求的相关义务（例如但可能不限于，已经通知了该第三方或已经获得了该第三方的同意）。</span>
                    </li>
                    <li>
                        <span>14.10.&nbsp;&nbsp;&nbsp;</span>
                        <span>不可抗力。任何一方因受不可抗力事件影响不能部分或全部履行协议的不承担责任。但您受不可抗力影响不能部分或全部履行协议的，应返还联想预付的费用。受不可抗力影响的一方应在不可抗力发生后在合理可行的最快时间内通知对方，并在五（5）日内向对方提供证实不可抗力发生的政府、公证机关或商会出具的证明或权威媒体的报道。因怠于通知造成对方损失的应予赔偿。不可抗力事件影响解除后，双方可协商继续履行本协议。</span>
                    </li>
                    <li>
                        <span>14.11.&nbsp;&nbsp;&nbsp;</span>
                        <span>适用法律和争议解决。本协议受中国大陆地区（不包括香港和澳门）可适用法律管辖，因本协议解释和执行发生的争议，应由双方友好协商解决，协商解决未果的，提交联想所在地有管辖权的法院裁决。本款规定并不限制任何一方根据法律规定寻求其他可行的法律救济的权利，包括但不限于申请禁止令或其他法律保护。</span>
                    </li>
                    <li>
                        <span>14.12.&nbsp;&nbsp;&nbsp;</span>
                        <span>优先适用。本协议内容与相关附件冲突，以本协议为准，但对于本协议允许另行约定的内容，则相关文件的优先效力如下：（A）相关附件；（B）本协议。[正文结束]</span>
                    </li>
                </ul>
                <h4>附件一  最终用户许可协议</h4>
                <p>请仔细阅读协议内容：</p>
                <p>本协议用于约束联想应用产品开发者（以下简称“开发者”）与最终用户（以下简称“您”）之间就您使用应用产品的权利义务。除非开发者与您另行达成《最终用户许可协议》，否则自您使用应用产品之时，本协议将在开发者与您之间生效。本协议同样适用于应用产品的任何更新与升级。</p>
                <p>只有当您接受本协议时，开发者才许可您在中国大陆（不包括港澳台地区）内使用应用产品。安装、下载或使用应用产品，即表示您接受本协议的条款。如果您不同意接受本协议，请您不要下载或使用本平台的应用产品，您与开发者另行达成《最终用户许可协议》的除外。</p>
                <h4>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;许可</h4>
                <ul>
                    <li>
                        <span>1.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>应用产品归开发者或其权利人所有，受版权保护且仅为许可，而不是销售。</span>
                    </li>
                    <li>
                        <span>1.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>仅在您遵守本协议的前提下，且仅为您个人研究或使用之目的，开发者给予您一个非独占的许可，使您有权在中国大陆（不包括港澳台地区）内自本平台下载应用产品于一台手持移动设备或计算机之上。</span>
                    </li>
                    <li>
                        <span>1.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>为备份之目的，您可且仅可复制一份应用产品作为副本，本协议之条款同样适用于该副本。</span>
                    </li>
                    <li>
                        <span>1.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如果您获得应用产品的升级版本，在安装该升级版本后，您即不得继续使用该应用产品的未升级版本，也不得将其转让给任何其他方。</span>
                    </li>
                    <li>
                        <span>1.5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您应确保使用应用产品的任何人（无论是通过本地访问还是远程访问）都只将应用产品用于您被授权的用途并遵守本协议的条款。</span>
                    </li>
                    <li>
                        <span>1.6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>在您接入互联网或移动网络的状态下，某些应用产品可能为您提供互联网信息服务。您应当依照您与该互联网信息服务提供商及网络运营商达成的协议使用该等互联网信息服务。</span>
                    </li>
                    <li>
                        <span>1.7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>除本协议明确授予您的许可外，开发者并未向您许可其他任何权利，无论是明示的还是默示的。</span>
                    </li>
                    <li>
                        <span>1.8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如果您违反了本协议的条款，开发者可以终止您的许可。如果开发者终止了您的许可，您必须销毁应用产品的所有副本。</span>
                    </li>
                    <li>
                        <span>1.9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如果可适用的法律规定您还拥有除本条款规定以外的其他权利，则依照该等法律执行。</span>
                    </li>
                </ul>
                <h4>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;限制</h4>
                <ul>
                    <li>
                        <span>2.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>除非获得开发者事先的书面许可，否则您不得从事：（A）修改、删除或避开应用产品中开发者为保护其知识产权而设置的任何技术措施；（B）修改或删除应用产品中体现开发者的任何标识或身份信息；（C）对应用产品进行任何反编译、反汇编或反向工程；（D）超出本协议许可的数量复制应用产品；（E）分许可、出租或出借应用产品；和（F）其他超出本协议许可范围的行为。</span>
                    </li>
                    <li>
                        <span>2.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如果依照可适用的法律，上述限制对您不适用，则依照该等法律执行。</span>
                    </li>
                </ul>
                <h4>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;服务</h4>
                <ul>
                    <li>
                        <span>3.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>开发者将为您提供应用产品的支持服务。请联系开发者以了解、享受或投诉应用产品的服务。</span>
                    </li>
                    <li>
                        <span>3.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>联想、联想的关联机构、联想产品的制造商无义务就应用产品提供任何服务。</span>
                    </li>
                </ul>
                <h4>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;无保证声明</h4>
                <ul>
                    <li>应用产品按“现状”提供。除了不可排除的任何法定保证外，开发者不提供任何明示或默示的保证或条件，包括但不限于有关应用产品或技术支持（如果有的话）的适销性、适用于某个特定目的，以及不侵权的默示保证或条件。
                        联想不就应用产品提供任何明示或默示的保证或条件，包括但不限于有关应用产品或技术支持的适销性、适用于某个特定目的，以及不侵权的默示保证或条件。</li>
                </ul>
                <h4>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;责任限制</h4>
                <ul>
                    <li>如开发者违约或有其他责任，您有权要求开发者赔偿损失。在上述情形下，无论您基于何种理由要求开发者赔偿损失（包括重大违约、过失、虚假陈述或其他合同或侵权方面的索赔），除根据可适用法律不能免除或限制的责任外，且仅在根据该法律不能免除或限制的范围内，开发者的赔偿责任仅限于您遭受的实际直接损失，且最高不超过您购买应用产品所支付的款项。此限制不适用于开发者应依法承担的人身伤害（包括死亡）、不动产和有形动产的损害赔偿责任。 </li>
                    <li>在任何情况下，开发者对下列情形均不承担责任，即使已被告知该情形有可能发生：（1）第三方向您提出的索赔；（2）您的数据丢失或损坏；或者（3）特殊的、附带的或间接的损害赔偿或任何后果性的经济损害赔偿，包括利润、业务收入、商誉或预期节余的损失。某些国家/地区或司法管辖区不允许对附带的或后果性的损害赔偿进行排除或限制，如果这样，则上述排除或限制可不适用于您。</li>
                    <li>联想不因本协议或应用产品向您承担任何责任。在任何情况下，联想对下列情形均不承担责任，即使已被告知该情形有可能发生：（1）第三方向您提出的索赔；（2）您的数据丢失或损坏；或者（3）特殊的、附带的或间接的损害赔偿或任何后果性的经济损害赔偿，包括利润、业务收入、商誉或预期节余的损失。某些国家/地区或司法管辖区不允许对附带的或后果性的损害赔偿进行排除或限制，如果这样，则上述排除或限制可不适用于您。</li>
                </ul>
                <h4>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;消费者权利</h4>
                <ul>
                    <li>本协议的任何条款均不影响不能通过合同予以放弃或限制的消费者的任何法定权利。本协议也不改变根据可适用的当地法律您可能拥有的其他权利。  </li>
                </ul>
                <h4>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;通则</h4>
                <ul>
                    <li>
                        <span>7.1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>如果本协议的任何条款被判定无效或不可强制执行，本协议的其余条款仍然具有完全的强制执行性和法律效力。</span>
                    </li>
                    <li>
                        <span>7.2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您同意遵守所有可适用的进出口法律和法规。</span>
                    </li>
                    <li>
                        <span>7.3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>您或开发者均不得在争议事由发生两（2）年后根据本协议提起法律行动，但当地法律另有规定不能通过合同方式弃权或予以限制的除外。 </span>
                    </li>
                    <li>
                        <span>7.4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>
                        <span>本协议受中华人民共和国法律（香港、澳门及台湾地区除外）管辖，就本协议所产生的争议应提交开发者所在地有管辖权的人民法院裁决。</span>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</template>
<script>
export default {
  name: "rule",
  data() {
    return {
      sectionText: true
    };
  },
  mounted() {
    window.scrollTo(0,0);
    if (this.$route.query) {
      if (this.$route.query.two) {
        this.sectionText = false;
      } else {
        this.sectionText = true;
      }
    } else {
      this.sectionText = true;
    }
  },
  methods: {
    showSectionOne() {
      this.sectionText = true;
    },
    showSectionTwo() {
      this.sectionText = false;
    }
  }
};
</script>
<style scoped>
.rule {
  width: 80%;
  margin: 30px auto;
  margin-top: 30px;
  overflow: hidden;
}
.rule .section {
  width: 85%;
  padding-top: 30px;
  padding-left: 30px;
  color: #333;
}
.rule .section h2 {
  text-align: left;
  margin: 15px 0;
}
.section h4 {
  margin: 15px 0;
}
.rule .list,
.rule .section {
  float: left;
}
.section > ul {
  overflow: hidden;
  padding-left: 30px;
}
.section > ul li {
  line-height: 22px;
  overflow: hidden;
}
.section > ul span:nth-child(1) {
  float: left;
  vertical-align: top;
}
.section > ul span:nth-child(2) {
  float: left;
  width: 93%;
}
.rule .list li {
  padding: 5px 10px;
  background: #b7b5b6;
  cursor: pointer;
}
.section_part {
  background: #e53e37 !important;
}
</style>


